[
  {
    "id": 1,
    "name": "Savan Singh",
    "comments": "Nagaraju was one of the best UI/UX designers in my team. He is intuitive, an active listener, creative and curious to learn. All these qualities makes him a very good member to any product designing team of an Organization. Nagaraju is truly skillful & handy with respect to designing tools & software's. He would be a good asset to any team.",
    "position": "Senior UI/UX & Graphic Designer",
    "companyName": "TeKreant"
  },
  {
    "id": 2,
    "name": "Naveen Kumar Krishnasamy",
    "comments": "Nagaraju joined us as a Graphic and Product Designer for our healthcare brand. He designed all our product labels and all digital ad creatives during his tenure. Out-of-the-box thinker and definitely innovative in creatives. His designs got us good conversions on our SM platforms. He would be a great asset to any team. If I were looking for a graphic designer, I would definitely hire him!",
    "position": "Business Analyst",
    "companyName": ""
  },
  {
    "id": 3,
    "name": "Shreya Ojha",
    "comments": "Nagaraju has always added a vivacious energy to the team with his persona and equally been a talented designer to work with.At GHC there was always an incoming of 20-25 mockups in once day and Nagaraju always delivered in time with his own insights and feedback as well for the designs and sometimes helping out with various options for us to choose from.",
    "position": "Brand Solutions",
    "companyName": ""
  },
  {
    "id": 4,
    "name": "Renu Sree",
    "comments": "Worked with Nagaraju as a team. He brings the skill and knowledge needed to explain the issues thoroughly and helps in solving quickly. I and my team always felt very flexible to work with him and ability to address my concern that I came up. His positive attitude and dedication towards work and desire to produce the quality work that served him well.",
    "position": "Talent acquisition operations specialist",
    "companyName": ""
  }
]
